Repository: ZbutwialyPiernik/flixage-app
Catalog: lib/l10n/intl_*.arb
Languages: pl

# common_unknownError
source: Unknown error
pl: Nieznany błąd

# common_validation_tooShort
source: Too short
pl: Zbyt krótkie

# common_validation_tooLong
source: Too long
pl: Zbyt długie

# common_validation_illegalCharacters
source: Illegal characters
pl: Nieprawidłowe znaki

# common_offline
source: You're offline
pl: Brak połączenia z internetem

# common_username
source: Username
pl: Nazwa użytkownika

# common_password
source: Password
pl: Hasło

# dio_requestTimeout
source: Request timeout
pl: Przekroczono limit czasu oczekiwania

# dio_connectionTimeout
source: Failed to connect to the server
pl: Nie udało się połączyć z serwerem

# dio_receiveTimeout
source: Timed out
pl: Przekroczono limit czasu oczekiwania

# splashScreen_welcome
source: Welcome Again!
pl: Witaj Ponownie!

# splashScreen_offline
source: You're offline, check your connection and try again
pl: Jesteś offline, sprawdź swoje połączenie i spróbuj ponownie

# settingsPage_title
source: Settings
pl: Ustawienia

# settingsPage_language
source: Language
pl: Język

# buttomAppBar_search
source: Search
pl: Wyszukaj

# bottomAppBar_library
source: Library
pl: Biblioteka

# libraryPage_tab_artists_title
source: Artists
pl: Artyści

# libraryPage_tab_artists_notPlayed
source: You haven't played any song yet
pl: Nie zagrałeś jescze żadnej piosenki

# libraryPage_tab_playlists_createPlaylist
source: Create playlist
pl: Stwórz playlistę

# libraryPage_tab_playlists_noPlaylists
source: You don't have any playlists yet
pl: Nie masz jeszcze żadnej playlisty

# libraryPage_tab_playlists_title
source: Playlists
pl: Playlisty

# libraryPage_tab_followed_title
source: Followed
pl: Obserwowane

# libraryPage_tab_followed_notFollowed
source: You don't follow any playlists yet
pl: Nie obserwujesz jeszcze żadnej playlisty

# loginPage_login
source: Login
pl: Zaloguj

# loginPage_serversUnavailable
source: Couldn't connect to server
pl: Nie udało się połączyć z serwerem

# loginPage_authenticationServiceUnvaiable
source: Authentication service unavailable
pl: Serwery uwierzytelniania są niedostępne

# registerPage_register
source: Register
pl: Zarejestruj

# queryablePage_playRandomly
source: Shuffle play
pl: Odtwarzaj losowo

# artistPage_albums
source: Albums
pl: Albumy

# artistPage_popular
source: Popular
pl: Popularne

# artistPage_singles
source: Singles
pl: Single

# artistPage_showAll
source: Show all
pl: Pokaż wszystkie

# createPlaylistPage_emptyName
source: Name cannot be empty
pl: Nazwa nie może być pusta

# playlistPage_author
source: Author: {name}
pl: Autor: {name}

# playlistPage_emptyPlaylist
source: Your playlist is empty
pl: Twoja playlista jest pusta

# searchPage_search
source: Search
pl: Wyszukaj

# searchPage_searchInFlixage
source: Search in Flixage
pl: Wyszukaj w Flixage

# searchPage_findFavouriteMusic
source: Find your favorite music
pl: Znajdź swoją ulubioną muzykę

# searchPage_unknownError
source: Unknown error has occurred :(
pl: Wystąpił nieznany błąd :(

# searchPage_notFound
source: Not found "{query}"
pl: Nie znaleziono "{query}"

# searchPage_tryAgain
source: Try again, checking the spelling
pl: Spróbuj ponownie, sprawdzając pisownie

# trackItem_track
source: Track â€¢ {name}
pl: Utwór • {name}

# artistItem_artist
source: Artist
pl: Artysta

# userItem_user
source: User
pl: Użytkownik

# playlistItem_playlist
source: Playlist
pl: Playlista

# playlistItem_createdBy
source: Created by {name}
pl: Stworzona przez {name}

# albumPage_monthlyListeners
source: Monthly listeners: {monthlyListeners}
pl: Słuchacze w tym miesiącu: {monthlyListeners}

# libraryFetchError
source: Problem during fetching user library
pl: Wystąpił problem podczas pobierania biblioteki

# playlistCreated
source: Playlist '{name}' has been created
pl: Playlista '{name}' została utworzona

# playlistCreateError
source: Problem during creation of playlist '{name}'
pl: Wystąpił problem podczas tworzenia playlisty '{name}'

# playlistDeleted
source: Playlist '{name}' has been deleted
pl: Playlista '{name}' została usunięta

# playlistDeleteError
source: Playlist during deletion of playlist '{name}'
pl: Wystąpił problem podczas usuwania playlisty '{name}'

# playlistUpdated
source: Playlist '{name}' has been updated
pl: Playlista '{name}' została zaktualizowana

# playlistUpdateError
source: Error during update of playlist '{name}'
pl: Wystąpił problem podczas aktualizacji playlisty '{name}'

# createPlaylistPage_namePlaylist
source: Name your playlist
pl: Nazwij swoją playlistę

# pickPlaylistPage_newPlaylist
source: New playlist
pl: Nowa Playlista

# pickPlaylistPage_addToPlaylist
source: Add to playlist
pl: Dodaj do playlisty

# albumPage_by
source: By {name}
pl: Album wykonawcy {name}

# authenticationPage_illegalCharacters
source: Illegal characters
pl: Niepoprawne znaki

# authenticationPage_login
source: Login
pl: Zaloguj

# authenticationPage_register
source: Don't have an account? Register now
pl: Nie masz konta? Zarejestruj się już dziś

# loginPage_invalidCredentials
source: Invalid Credentials
pl: Nieprawidłowe dane logowania

# playlistContextMenu_editPlaylist
source: Edit playlist
pl: Edytuj playlistę

# playlistContextMenu_removePlaylist
source: Remove playlist
pl: Usuń playlistę

# playlistContextMenu_sharePlaylist
source: Share playlist
pl: Udostępnij playlistę

# playlistPage_playlistLoadingError
source: Playlist loading error
pl: Wystąpił problem z ładowaniem playlisty

# playlistPage_thumbnailChanged
source: Thumbnail changed
pl: Zmieniono miniaturkę

# playlistPage_unsupportedExtension
source: Unsupported extension
pl: Niewspierane rozszerzenie

# registerPage_validation_oneDigit
source: Should contain at least one digit
pl: Powinno zawierać co najmniej jedną cyfrę

# registerPage_validation_oneLower
source: Should contain at least one lower-case
pl: Powinno zawierać co najmniej jedną małą literę

# registerPage_validation_oneUpper
source: Should contain at least one upper-case
pl: Powinno zawierać co najmniej jedną wielką literę

# registerPage_validation_passwordDoesNotMatch
source: Passwords does not match
pl: Hasła nie są takie same

# registerPage_validation_usernameTaken
source: Username is already taken
pl: Nazwa użytkownika już jest zajęta

# registerPage_repeatPassword
source: Repeat password
pl: Powtórz hasło

# settingsPage_logout
source: Logout
pl: Wyloguj

# trackAddError
source: Error during adding track to playlist "{name}"
pl: Błąd podczas dodawania utworu do playlisty „{name}”

# trackAdded
source: Track has been added to playlist "{name}"
pl: Utwór został dodany do playlisty „{name}”

# trackContextMenu_addToPlaylist
source: Add to playlist
pl: Dodaj do playlisty

# trackContextMenu_showAlbum
source: Show album
pl: Pokaż album

# trackContextMenu_showArtist
source: Show artist
pl: Pokaż artystę

# homePage_welcome
source: Welcome {name}!
pl: Witaj {name}!

# homePage_newReleases
source: New releases
pl: Nowe wydania

# homePage_latestArtists
source: Latest artists
pl: Najnowsi artyści

# homePage_latestSingles
source: Latest singles
pl: Najnowsze single

# homePage_recentlyPlayed
source: Recently played
pl: Ostatnio odtwarzane
